Repository: eduraya/anugrahpratama-webasyst
Catalog: *-apps/apiexplorer/locale/*/LC_MESSAGES/apiexplorer.po
Languages: ru_ru

source: <strong>API Explorer</strong> is intended for testing APIs of other apps powered by the Webasyst framework. It supports only standard API, implemented by means of the <code>waAPIMethod</code> class, which works via the <strong><code>/api.php</code></strong> endpoint.
ru_ru: Приложение <strong>API Explorer</strong> предназначено для тестирования API других приложений, работающих на основе фреймворка Webasyst. Поддерживается только стандартный вид API, реализованный с использованием класса <code>waAPIMethod</code> и работающий через точку входа <strong><code>/api.php</code></strong>.

source: Retrieving of API methods info
ru_ru: Сбор информации о методах API

source: API Explorer can retrieve information only about API methods of the apps to which a current user has access.
ru_ru: API Explorer умеет получать информацию о методах API только тех установленных приложений, к которым имеет доступ текущий пользователь.

source: If a selected app contains a file with API methods’ descriptions in the <a href="https://swagger.io/resources/open-api/" target="_blank">Open API (Swagger)</a> format then this description file is used. The relative path to the description file in the app’s folder must be <code>api/swagger/v1.yaml</code>.
ru_ru: Если в выбранном приложении есть файл с описаниями методов API в формате <a href="https://swagger.io/resources/open-api/" target="_blank">Open API (Swagger)</a>, то используется это описание. Относительный путь к этому файлу в папке приложения должен быть <code>api/swagger/v1.yaml</code>.

source: If an app contains no such file then the list of its API methods is automatically obtained from the app’s <code>api/</code> folder.
ru_ru: Если такого файла в составе приложения нет, то список его методов API собирается автоматически из содержимого папки <code>api/</code>.

source: To display the method list as fast as possible, API Explorer generates it once and then saves it to cache. Therefore, if you need to refresh the list — for instance, if you have added a new API method to your own app and would like to see how API Explorer will display it — clear the Webasyst cache and reload the browser tab.
ru_ru: Чтобы отображать список методов как можно быстрее, API Explorer формирует его один раз и потом кеширует. Поэтому, если нужно обновить этот список (например, вы добавили новый метод API в свое приложение и хотите посмотреть, как его покажет API Explorer), очистите кеш фреймворка и обновите вкладку браузера.

source: Access rights
ru_ru: Права доступа

source: A user <em>without</em> administrator access rights can execute API methods on their own behalf only.
ru_ru: Пользователь, <em>не</em> являющийся администратором системы, может выполнять вызовы методов API только от своего лица.

source: A user <em>with</em> administrator access rights can also select an arbitrary user in the sidebar and call API methods on behalf of that user.
ru_ru: Пользователь <em>с правами</em> администратора может также выбрать в боковой панели любого другого пользователя, от лица которого нужно выполнять вызовы.

source: Auto-creation of access token
ru_ru: Автоматическое создание токена

source: API Explorer facilitates accessing the API, which in ordinary conditions <a href="https://developers.webasyst.com/features/apis/" target="_blank">requires an access token</a>. A token allowing access to all installed apps’ APIs is created automatically when a user is selected in the sidebar, with that user’s access rights taken into account.
ru_ru: API Explorer помогает быстро получить доступ к API, для чего в обычных рабочих условиях <a href="https://developers.webasyst.ru/docs/features/apis/" target="_blank">необходим токен доступа</a>. Токен для работы с API всех установленных приложений создается автоматически при выборе пользователя в боковой панели — с учетом прав доступа этого пользователя.

source: An automatically created token can be deleted when necessary — via the <em>Show token → <strong>Delete</strong></em> item on any API method viewing page.
ru_ru: Автоматически созданный токен можно при необходимости удалить — с помощью пункта «<em>Показать токен → <strong>Удалить</strong></em>» на странице просмотра любого метода API.
